app/controllers/beers_controller.rb

  def show
    @beer = Beer.find(params[:id])
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]

  def show_by_brewery
    @brewery = Brewery.find(params[:id])
    @beers = Beer.where("brewery_id = #{params[:id]}")
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1 LIMIT $2  [["id", 137], ["LIMIT", 1]]
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 153], ["LIMIT", 1]]