app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries" ORDER BY created_at desc
---
  def index
    @breweries = Brewery.all

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]
---
  def show
    @beers = Beer.where("brewery_id = #{params[:id]}")
    @brewery = Brewery.find(params[:id])